-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Mar 30, 2020 at 07:37 AM
-- Server version: 5.6.21
-- PHP Version: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `board`
--

-- --------------------------------------------------------

--
-- Table structure for table `answer`
--

CREATE TABLE IF NOT EXISTS `answer` (
`a_no` int(5) NOT NULL,
  `q_no` int(5) NOT NULL,
  `a_detail` longtext NOT NULL,
  `a_user` varchar(50) NOT NULL,
  `a_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB AUTO_INCREMENT=229 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `answer`
--

INSERT INTO `answer` (`a_no`, `q_no`, `a_detail`, `a_user`, `a_date`) VALUES
(214, 128, 'เกมอื่นก็สนุกครับลองเปิดใจเล่นดู', 'men', '2020-03-29 20:38:38'),
(215, 128, 'ลองเล่นเกมอื่นดูบ้างก็ไม่เสียหายนิครับ', 'Onizuka', '2020-03-29 20:50:52');

-- --------------------------------------------------------

--
-- Table structure for table `question`
--

CREATE TABLE IF NOT EXISTS `question` (
`q_no` int(4) NOT NULL,
  `q_topic` varchar(200) NOT NULL,
  `q_detail` longtext NOT NULL,
  `q_category` varchar(30) NOT NULL,
  `q_picture` text NOT NULL,
  `q_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `q_tag` varchar(100) NOT NULL,
  `q_user` varchar(50) NOT NULL,
  `q_view` int(6) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=145 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `question`
--

INSERT INTO `question` (`q_no`, `q_topic`, `q_detail`, `q_category`, `q_picture`, `q_date`, `q_tag`, `q_user`, `q_view`) VALUES
(128, 'ใครเล่น rov แล้ว ไปเล่นเกมแนว moba อื่นไม่สนุกเหมือนเล่น rov บ้างครับ', 'รู้สึกอยากลองเล่น เกมmoba แบบอื่นบ้างก็เลยลองโหลดมาเล่นแต่พอลองเล่นแล้ว....มันยังไม่ถึงอะ หรือผมคิดไปเอง', 'เกม', '../webboard/img/images.jpg', '2020-03-29 13:44:06', 'เกมrov,เกมmoba', 'sirisak', 202),
(130, 'ผลกระทบทางเศรษฐศาสตร์จาก “ไวรัสโควิด-19”', 'คอลัมน์ ทันเศรษฐกิจ โดย...ศาสตราจารย์ ดร.พิริยะ ผลพิรุฬห์ศาสตราจารย์ได้รับเงินเดือนขั้นสูง (ศาสตราจารย์ 11) และผู้อำนวยการ ศูนย์ศึกษาพัฒนาการเศรษฐกิจสถาบันบันฑิตพัฒนบริหารศาสตร์ (นิด้า)www.econ.nida.ac.th; piriya@nida.ac.th\r\nเป็นที่แน่ชัดแล้วว่า การแพร่ระบาดของเชื้อไวรัสโควิด-19 กำลังส่งผลกระทบไปทั่วโลกเป็นวงกว้าง เริ่มต้นจากการมีผู้ติดเชื้อที่เมืองอู่ฮั่น ประเทศจีน และแพร่กระจายไปทั่วโลก อันส่งผลให้เกิดผู้เจ็บป่วยและเสียชีวิตเป็นจำนวนมาก นอกจากนั้นเจ้าไวรัสตัวนี้เองยังกระทบไปถึงการชะงักงันของอุตสาหกรรมท่องเที่ยวและอุตสาหกรรมที่เกี่ยวเนื่อง ทั้งการยกเลิกเที่ยวบิน การยกเลิกการจองโรงแรม การยกเลิกกิจกรรมต่าง ๆ ลามไปถึงการชะลอการผลิตในภาคอุตสาหกรรมทั่วโลกที่อยู่ภายใต้ระบบห่วงโซ่คุณค่าโลก (Global Value Chain) อันส่งผลต่อเนื่องไปสู่ผลกระทบด้านการค้าและการลงทุนทั้งภายในประเทศและระหว่างประเทศ นอกจากนี้ยังรวมไปถึง การที่ประชาชนจะต้องเสียค่าใช้จ่ายกับการป้องกันการติดเชื้อ (เช่นต้องซื้อหน้ากากหรือเจลล้างมือ) รวมไปถึง การที่คนจะต้องมีการกักตัวอยู่กับบ้านจนทำให้ขาดรายได้ จนลามมาถึงการเกิดความเครียดและปัญหาทางสุขภาพจิตตามมา นอกจากนี้ ในภาคการเงินเองการแพร่ระบาดของไวรัวโควิด-19 ก็ส่งผลต่อการตกลงในตลาดหุ้นทั่วโลก รวมไปถึงการที่อีกหลายประเทศเลือกที่จะทำการ “ปิดประเทศ” อันทำให้เกิดการถดถอยทางเศรษฐกิจอย่างรุนแรง ดังนั้นจึงไม่สามารถปฏิเสธได้ว่า เศรษฐกิจโลกของเรากำลังเข้าสู่วิกฤตเศรษฐกิจ (Global Economic Crisis) ซึ่งมีที่มาจาก วิกฤตสุขภาพ (Global Health Crisis) เป็นสำคัญ\r\n\r\nนักเศรษฐศาสตร์ได้วิเคราะห์ว่า ผลกระทบทางลบจากการแพร่กระจายของเชื้อไวรัสโควิด-19 นี้จะตกกับครอบครัวผู้ที่มีความไม่มั่นคงทางเศรษฐกิจ (Vulnerable Families) เป็นหลัก โดยเฉพาะคนยากจนที่ต้องทำงานหาเลี้ยงชีพเป็นวันๆ ซึ่งคนเหล่านี้จะต้องตกงาน สูญเสียรายได้ ซ้ำร้าย คนยากจนเหล่านี้ยังไม่สามารถเข้าถึงบริการทางด้านสาธารณสุขได้เท่ากับคนที่มีฐานะ ทั้งการหาซื้อหน้ากากอนามัย การหาซื้อเจลล้างมือ รวมไปถึงแม้กระทั่งการเข้าถึงบริการของการตรวจโรค และอาจจะส่งผลต่อการเสียชีวิตตามมาได้\r\n\r\nดังนั้น ในการวิเคราะห์ผลกระทบทางเศรษฐศาสตร์ที่เกิดจากไวรัสโควิด-19 นี้ จึงไม่สามารถวิเคราะห์ได้เพียงด้านใดด้านหนึ่ง เนื่องจากผลกระทบนี้มันเกิดขึ้นทั้งในเชิงเศรษฐกิจในหลากหลายสาขา ในเชิงสังคม และผลกระทบต่อการใช้ชีวิตประจำวัน แต่ทั้งนี้สามารถวิเคราะห์ได้ตามแผนภูมิที่แนบมาดังนี้\r\n\r\nผลกระทบในระยะสั้น\r\n\r\n1) ผลกระทบต่อการเจ็บไข้ได้ป่วยและการเสียชีวิต (Direct Costs from Sickness and Mortality) – แน่นอนว่า ผลกระทบทางตรง (Direct Effects) ของการแพร่ระบาดของไวรัสโควิด-19 จะต้องเริ่มจากผลกระทบด้านสุขภาพเป็นอย่างแรก ซึ่งผลกระทบนี้จะเริ่มตั้งแต่ การที่มีผู้เจ็บป่วยจากการติดเชื้อจำนวนมาก อันนำมาสู่ค่าใช้จ่ายในการรักษา และร้ายที่สุดก็คือการเสียชีวิต ซึ่งการที่มีผู้เจ็บไข้ได้ป่วยเป็นจำนวนมากนี้เองย่อมกระทบไปถึงข้อจำกัดในการจัดสรรทรัพยากรด้านสาธารณสุขของประเทศ ทั้งทางด้านกำลังคน งบประมาณ สถานที่ และอุปกรณ์ทางการแพทย์ต่าง ๆ ที่หลายประเทศต้องประสบปัญหาข้อจำกัดในด้านนี้ และด้วยข้อจำกัดนี้เองจึงส่งผลทำให้เกิดความเหลื่อมล้ำในการเข้าถึงระบบสาธารณสุข โดยเฉพาะกับคนจนที่จะต้องเป็นผู้แบกรับปัญหาดังกล่าว\r\n\r\n2) ผลกระทบต่อการจ้างงาน ค่าจ้าง ความยากจน และความเหลื่อมล้ำ – เมื่อมีผู้เจ็บป่วยจากการติดเชื้อเป็นจำนวนมาก ย่อมส่งผลไปสู่การสูญเสียรายได้ ซึ่งจะส่งผลกระทบไปสู่ค่าใช้จ่ายภายในครัวเรือน โดยเฉพาะกับกลุ่มผู้สูงอายุซึ่งจะมีแนวโน้มของการติดเชื้อไวรัสนี้มากที่สุด โดยการสูญเสียงานหรือเสียรายได้นี้จะมีโอกาสเกิดขึ้นกับคนทีมีฐานะยากจนที่เป็นแรงงานนอกระบบ (Informal Worker) มากกว่าคนที่มีรายได้แน่นอนจากงานประจำ และมีโอกาสที่จะเกิดขึ้นในประเทศด้อยพัฒนา/กำลังพัฒนามากกว่าประเทศที่พัฒนาแล้ว ดังนั้นผลกระทบจากการแพร่ระบาดของเชื่อไวรัสโควิด-19 นี้ จะส่งผลต่อเนื่องไปสู่ระดับความยากจนและความเหลื่อมล้ำที่จะเพิ่มสูงขึ้นได้\r\n\r\n3) ผลกระทบต่อภาคอุตสาหกรรมการผลิต – ในภาคอุตสาหกรรมการผลิตเองก็ต้องประสบปัญหาการชะงักงันในการผลิต โดยเฉพาะภาคอุตสาหกรรมที่จะต้องพึ่งพาการนำเข้าจากประเทศจีน ซึ่งได้รับฉายาว่าเป็นโรงงานการผลิตของโลก (The World’s Factory) ซึ่งเมื่อภาคอุตสาหกรรมในประเทศจีนจำเป็นต้องหยุดการผลิตในโรงงานแล้ว ย่อมกระทบกับยอดการผลิตและการส่งออกจากภาคอุตสาหกรรมทั่วโลก โดยเฉพาะกับประเทศกำลังพัฒนาอย่างประเทศไทยที่ระบบเศรษฐกิจจำต้องพึ่งพาการค้าระหว่างประเทศเป็นสำคัญ\r\n\r\n4) ผลกระทบจากพฤติกรรมที่หลีกเลี่ยง (Aversion Behavior) – เพื่อให้ห่างไกลจากโอกาสในการติดชื้อไวรัส ประชาชน (รวมไปถึงรัฐบาลของหลายประเทศ) ได้ตัดสินใจที่จะยกเลิกกิจกรรมที่จะส่งผลต่อการแพร่กระจายของเชื้อไวรัส ตั้งแต่ 1) การที่ภาครัฐในหลายประเทศที่ตัดสินใจปิดประเทศ/ปิดเมืองและห้ามให้เกิดการเดินทางระหว่างกัน 2) การประกาศให้ธุรกิจหรือสถานบริการที่โดยปกติจะต้องรับคนเป็นจำนวนมากต้องปิดทำการชั่วคราว 3) สถาบันการศึกษาที่จำเป็นต้องหยุดการเรียนการสอน (ถึงแม้ว่าจะมีการเรียนการสอนออนไลน์เข้ามาช่วยก็ตาม) และ 4) ประชาชนที่ต้องกักตัวเองอยู่กับบ้านด้วยสาเหตุต่าง ๆ เพื่อพยายามที่จะควบคุมการแพร่กระจายของเชื้อไวรัสโควิด-19 นี้ ซึ่งการหยุดกิจกรรมต่าง ๆ นี้ จะกระทบไปสู่ภาคธุรกิจที่เกี่ยวข้องกับการท่องเที่ยว การขนส่ง และธุรกิจด้านการค้าปลีกต่าง ๆ และกระทบต่อยอดไปสู่ทั้งอุตสาหกรรมต้นน้ำ (Upstream) ของภาคบริการเหล่านี้ที่จะต้องเกิดปัญหาการชะงักงันตามมา\r\n\r\n5) ผลกระทบต่อผู้บริโภค – เมื่อกิจกรรมต่าง ๆ ข้างต้นเกิดการชะงักงัน สิ่งที่เกิดขึ้นก็คือ การเกิดผลกระทบทางลบด้านอุปทานการผลิต (Adverse Supply Shock) อันจะส่งผลต่อสภาวะการเงินเฟื้อในสินค้าที่จำเป็นบางประเภทได้ เช่น หน้ากากอนามัย หรือเจลล้างมือ เกิดสินค้าขาดแคลนและผู้ขายเห็นช่องทางในการเก็งกำไร\r\n\r\nผลกระทบต่อภาคเศรษฐกิจทั้งหมด – แน่นอนว่า เมื่ออุปสงค์ในสินค้าต่าง ๆ ลดลงแล้ว ย่อมส่งผลทำให้เกิดเศรษฐกิจถดถอยอย่างหลีกเลี่ยงไม่ได้\r\n\r\nผลกระทบในระยะสั้นเหล่านี้อาจส่งผลไปสู่ผลกระทบระยะยาวได้ เช่น การที่ประเทศจะสูญเสียขีดความสามารถในการแข่งขันและการเจริญเติบโตทางเศรษฐกิจในระยะยาว (Long-Term Economic Growth) เนื่องจากจะต้องใช้ทรัพยากรจำนวนมากในการป้องกันและรักษาเชื้อไวรัสโควิด-19 นี้ จนขาดแคลนทรัพยากรในการลงทุนในโครงสร้างพื้นฐานที่จำเป็น นอกจากนี้ยังเกิดการสูญเสียทางด้านทุนมนุษย์ (Human Capital) ของประเทศ ที่จะต้องเจ็บไข้ได้ป่วยเรื้อรัง (เช่นโรคที่เกี่ยวข้องกับปอด) หรือการที่เด็กนักเรียนนักศึกษาจะต้องหยุดเรียน โดยเฉพาะในประเทศที่มีฐานะยากจนที่ระบบการพัฒนาทุนมนุษย์อย่างระบบสาธารณสุขและระบบการศึกษายังไม่ครอบคลุมทั่วถึงนัก\r\n\r\nสำหรับผลกระทบในประเทศต่าง ๆ งานศึกษาของ Baker-McKenzie ได้พยากรณ์ว่า ผลกระทบทางเศรษฐกิจนี้จะกระจายไปถึงประเทศในกลุ่มประเทศแอฟริกา เนื่องจากประเทศเหล่านี้ทำหน้าที่ในการป้อนวัตถุดิบไปยังประเทศจีนและยุโรป โดยเฉพาะในอุตสาหกรรมพลังงาน ถ่านหิน นอกจากนี้ ยังกระทบไปถึงอุตสาหกรรมการท่องเที่ยว ในขณะที่งานศึกษาของ Asian Development Bank ได้พยากรณ์ในเดือนมีนาคมที่ผ่านมาถึงผลกระทบต่อประเทศในกลุ่มเอเชีย โดยพยากรณ์ว่า ประเทศที่จะได้รับผลกระทบทางเศรษฐกิจมากที่สุดจากการชะลอตัวของเศรษฐกิจจีนจากไวรัสโควิด-19 นี้ก็คือ ประเทศมัลดีฟ กัมพูชา และไทย\r\n\r\nอย่างไรก็ดี งานศึกษาดังกล่าวนี้เป็นเพียงการพยากรณ์จากผลกระทบของการที่เศรษฐกิจจีนเกิดการชะงักงันจากเชื้อไวรัสนี้เท่านั้น แต่เมื่อเชื้อไวรัสได้แพร่กระจายไปยังประเทศใหญ่อย่างสหรัฐอเมริกาและกลุ่มประเทศยุโรป แน่นอนว่า ผลกระทบดังกล่าวย่อมเกิดขึ้นในวงกว้างอย่างมหาศาลกว่าที่ประมาณการณ์มากนัก\r\n\r\nในกรณีของประเทศไทยในเบื้องต้น ล่าสุดศูนย์วิจัย ธนาคารกรุงศรีอยุธยา ได้คาดการณ์ว่า ในปีนี้เศรษฐกิจไทยน่าจะประสบกับ GDP ที่ติดลบประมาณ 0.8% ซึ่งมาจากภาคการส่งออกที่จะติดลบ 6% และการลงทุนที่จะติดลบ 1.5% นี่ยังไม่รวมในกรณีของปัจจัยที่จะกระทบนอกเหนือจากนี้ เช่น ปัญหาภัยแร้ง หรือ อาจเกิด “ความไม่มั่นคงของรัฐบาล” ที่อาจส่งผลไปสู่การปรับเปลี่ยนคณะรัฐมนตรีอันจะยิ่งซ้ำเติมต่อความไม่มั่นคงของเศรษฐกิจไทยในระยะยาวได้\r\n\r\nทั้งนี้ International Monetary Fund (IMF) ได้นำเสนอวิธีการลดผลกระทบทางเศรษฐกิจที่จะเกิดขึ้นจากการแพร่กระจายของเชื้อไวรัสโควิด-19 ไว้ดังนี้\r\n\r\n1) รัฐบาลของประเทศนั้น ๆ จะต้องจริงใจและให้ความสำคัญกับการแก้ไขปัญหาการแพร่กระจายของเชื้อไวรัสนี้เป็นอันดับแรก และสื่อสารให้ประชาชนได้รับทราบข้อมูลข่าวสารและแนวทางการแก้ไขของภาครัฐตลอดเวลา เพื่อลดการตื่นตระหนกของประชาชน อันส่งผลทำให้ประชาชนเกิดการป้องกัน อันมีส่วนช่วยในการลดการแพร่ระบาดของเชื้อไวรัสนี้ได้โดยเร็ว และแน่นอนว่า ประเทศที่มีการจัดการการแพร่กระจายได้ดี ประเทศนั้นก็จะสามารถฟื้นฟูประเทศจากการถดถอยทางเศรษฐกิจได้เร็วขึ้น\r\n\r\n2) รัฐบาลจะต้องพัฒนาระบบการช่วยเหลือผ่านช่องทางทางระบบสวัสดิการทางสังคม ไม่ควรที่จะช่วยเหลือกับทุกคนแบบหว่านแห แต่การช่วยเหลือควรกำหนดไปที่กลุ่มเป้าหมายที่ได้รับผลกระทบโดยตรงจากเชื้อไวรัสนี้ก่อน เช่นครัวเรือนที่มีฐานะยากจนหรือครัวเรือนที่ทำงานในสาขาที่สูญเสียงานหรือรายได้จากเชื้อไวรัวนี้โดยตรง โดยการช่วยเหลือควรที่จะเกี่ยวข้องกับการป้องกันโรคไวรัสนี้เป็นหลัก เช่น การสนับสนุนการตรวจและการรักษาฟรี การช่วยเหลือผู้ที่ตกงานผ่านระบบการสร้างงานสาธารณะ (Public Work Program) หรือ การให้เงินช่วยเหลือแก่วิสาหกิจขนาดเล็กที่ได้รับผลกระทบ\r\n\r\n3) พัฒนาระบบการช่วยเหลือโดยใช้เทคโนโลยีสารสนเทศ เช่น การเก็บข้อมูลในระบบ Just-in-Time ผ่าน Application ที่สามารถรวบรวมบุคลากรทางการแพทย์ให้เข้ามาทำงานร่วมกัน การแชร์ข้อมูลข่าวสาร และการให้ข้อมูลข่าวสารในการเข้าถึงสินค้าที่จำเป็น (เช่น หน้ากากอนามัยหรือเจลล้างมือ) แบบ Real Time รวมไปถึงการรวบรวมสถิติการติดชื้อและรักษาเพื่อที่จะนำมาปรับปรุงกระบวนการทำงานทางสาธารณสุขในประเทศต่อไป\r\n\r\nในทางปฏิบัติ นโยบายเหล่านี้จะมีความแตกต่างกันบ้างในแต่ละประเทศ ขึ้นอยู่กับบริบททางเศรษฐกิจและสังคมของประเทศนั้น ๆ อย่างไรก็ดี ผลกระทบทางเศรษฐศาสตร์จากเชื้อไวรัสโควิด-19 นี้ จะมากหรือน้อยก็ขึ้นอยู่กับ “ความเป็นผู้นำ” ในการแก้ไขปัญหาจากฝั่งรัฐบาล ทั้งการตัดสินใจที่ฉับไว การทำงานที่ประสานกัน และความจริงใจของคนในประเทศที่พร้อมจะแก้ปัญหานี้ด้วยกัน', 'กีฬา สุขภาพ', '../webboard/img/5BAF9ED3ED0BB59C99AE0EE79A83F876.jpg', '2020-03-29 14:38:55', 'ไวรัสโควิด-19', 'men', 28);

-- --------------------------------------------------------

--
-- Table structure for table `reply`
--

CREATE TABLE IF NOT EXISTS `reply` (
`r_no` int(5) NOT NULL,
  `a_no` int(5) NOT NULL,
  `r_detail` longtext NOT NULL,
  `r_user_reply` varchar(50) NOT NULL,
  `r_user` varchar(50) NOT NULL,
  `r_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB AUTO_INCREMENT=68 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `reply`
--

INSERT INTO `reply` (`r_no`, `a_no`, `r_detail`, `r_user_reply`, `r_user`, `r_date`) VALUES
(64, 214, 'เดี๋ยวจะลองตั้งใจเล่นดูครับ อาจจะสนุกว่าที่ผมคิดไว้', '', 'sirisak', '2020-03-29 20:40:42'),
(65, 214, 'ลองเล่นดูครับอาจจะติดกว่าเกม rov ก็ได้ครับ', '@sirisak', 'men', '2020-03-29 20:58:58'),
(66, 227, 'ทดสอบการตอบกลับ', '', 'sirisak', '2020-03-30 02:36:37');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `answer`
--
ALTER TABLE `answer`
 ADD PRIMARY KEY (`a_no`);

--
-- Indexes for table `question`
--
ALTER TABLE `question`
 ADD PRIMARY KEY (`q_no`);

--
-- Indexes for table `reply`
--
ALTER TABLE `reply`
 ADD PRIMARY KEY (`r_no`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `answer`
--
ALTER TABLE `answer`
MODIFY `a_no` int(5) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=229;
--
-- AUTO_INCREMENT for table `question`
--
ALTER TABLE `question`
MODIFY `q_no` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=145;
--
-- AUTO_INCREMENT for table `reply`
--
ALTER TABLE `reply`
MODIFY `r_no` int(5) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=68;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
